In [1]:
import pandas as pd

In [2]:
clean_df = pd.read_csv("../DataFiles/clean_data.csv", compression='gzip')

In [3]:
clean_df.head()

,Unnamed: 0,loan_amnt,term,int_rate,issue_d,purpose,zip_code,addr_state,annual_inc,home_ownership
0,0,2500,36,13.56,12-2018,debt_consolidation,109xx,NY,55000.0,RENT
1,1,30000,60,18.94,12-2018,debt_consolidation,713xx,LA,90000.0,MORTGAGE
2,2,5000,36,17.97,12-2018,debt_consolidation,490xx,MI,59280.0,MORTGAGE
3,3,4000,36,18.94,12-2018,debt_consolidation,985xx,WA,92000.0,MORTGAGE
4,4,30000,60,16.14,12-2018,debt_consolidation,212xx,MD,57250.0,MORTGAGE

In [4]:
clean_df.count()

Unnamed: 0        2260668
loan_amnt         2260668
term              2260668
int_rate          2260668
issue_d           2260668
purpose           2260668
zip_code          2260667
addr_state        2260668
annual_inc        2260664
home_ownership    2260668
dtype: int64

In [7]:
clean_df.dtypes

Unnamed: 0          int64
loan_amnt           int64
term                int64
int_rate          float64
issue_d            object
purpose            object
zip_code           object
addr_state         object
annual_inc        float64
home_ownership     object
dtype: object

In [9]:
len(clean_df)

2260668

In [12]:
clean_df.describe()

         Unnamed: 0     loan_amnt          term      int_rate    annual_inc
count  2.260668e+06  2.260668e+06  2.260668e+06  2.260668e+06  2.260664e+06
mean   1.130334e+06  1.504693e+04  4.291032e+01  1.309291e+01  7.799243e+04
std    6.525988e+05  9.190245e+03  1.086716e+01  4.832114e+00  1.126962e+05
min    0.000000e+00  5.000000e+02  3.600000e+01  5.310000e+00  0.000000e+00
25%    5.651668e+05  8.000000e+03  3.600000e+01  9.490000e+00  4.600000e+04
50%    1.130334e+06  1.290000e+04  3.600000e+01  1.262000e+01  6.500000e+04
75%    1.695500e+06  2.000000e+04  6.000000e+01  1.599000e+01  9.300000e+04
max    2.260667e+06  4.000000e+04  6.000000e+01  3.099000e+01  1.100000e+08

In [14]:
clean_df.columns

Index(['Unnamed: 0', 'loan_amnt', 'term', 'int_rate', 'issue_d', 'purpose',
       'zip_code', 'addr_state', 'annual_inc', 'home_ownership'],
      dtype='object')

In [16]:
clean_df = clean_df[['loan_amnt', 'term', 'int_rate', 'issue_d', 'purpose',
       'zip_code', 'addr_state', 'annual_inc', 'home_ownership']]

In [17]:
clean_df.head()

,loan_amnt,term,int_rate,issue_d,purpose,zip_code,addr_state,annual_inc,home_ownership
0,2500,36,13.56,12-2018,debt_consolidation,109xx,NY,55000.0,RENT
1,30000,60,18.94,12-2018,debt_consolidation,713xx,LA,90000.0,MORTGAGE
2,5000,36,17.97,12-2018,debt_consolidation,490xx,MI,59280.0,MORTGAGE
3,4000,36,18.94,12-2018,debt_consolidation,985xx,WA,92000.0,MORTGAGE
4,30000,60,16.14,12-2018,debt_consolidation,212xx,MD,57250.0,MORTGAGE

In [22]:
clean_df['addr_state'].unique()

array(['NY', 'LA', 'MI', 'WA', 'MD', 'IN', 'IL', 'FL', 'CT', 'GA', 'UT',
       'NC', 'KY', 'OH', 'AR', 'OK', 'CA', 'WV', 'NJ', 'SC', 'TX', 'PA',
       'KS', 'AL', 'VA', 'MO', 'AZ', 'NM', 'CO', 'RI', 'WI', 'TN', 'NV',
       'MA', 'NE', 'MN', 'NH', 'OR', 'VT', 'DC', 'MS', 'ID', 'DE', 'ND',
       'HI', 'ME', 'AK', 'WY', 'MT', 'SD', 'IA'], dtype=object)

In [23]:
state_demo_df = pd.read_csv('../DataFiles/StateDemoData.csv')

In [25]:
state_credit_df = pd.read_csv('../DataFiles/stateCredit.csv')

In [26]:
state_demo_df.head()

,Unnamed: 0,State,Abr.,Municipal Population,2018,2017,2016
0,0,Alabama,AL,198218,"$49,861","$48,123","$46,257"
1,1,Alaska,AK,31275,"$74,346","$73,181","$76,440"
2,2,Arizona,AZ,1660272,"$59,246","$56,581","$53,558"
3,3,Arkansas,AR,193524,"$47,062","$45,869","$44,334"
4,4,California,CA,508529,"$75,277","$71,805","$67,739"

In [27]:
state_credit_df.head()

   Unnamed: 0         0                     1                            2
0           0     State  Average VantageScore  Average Credit Card Balance
1           1   Alabama                   654                       $5,961
2           2    Alaska                   668                       $8,516
3           3   Arizona                   669                       $6,389
4           4  Arkansas                   657                       $5,660

In [28]:
state_demo_df.columns

Index(['Unnamed: 0', 'State', 'Abr.', 'Municipal Population', '2018', '2017',
       '2016'],
      dtype='object')

In [29]:
state_demo_df = state_demo_df[['State', 'Abr.', 'Municipal Population', '2018', '2017',
       '2016']]

In [30]:
state_demo_df.head()

        State Abr.  Municipal Population     2018     2017     2016
0     Alabama   AL                198218  $49,861  $48,123  $46,257
1      Alaska   AK                 31275  $74,346  $73,181  $76,440
2     Arizona   AZ               1660272  $59,246  $56,581  $53,558
3    Arkansas   AR                193524  $47,062  $45,869  $44,334
4  California   CA                508529  $75,277  $71,805  $67,739

In [31]:
state_credit_df.columns = state_credit_df.iloc[0]

In [33]:
state_credit_df = state_credit_df[1:]

In [35]:
state_credit_df.columns

Index([0, 'State', 'Average VantageScore', 'Average Credit Card Balance'], dtype='object', name=0)

In [36]:
state_credit_df = state_credit_df[['State', 'Average VantageScore', 'Average Credit Card Balance']]

In [37]:
state_credit_df.head()

0       State Average VantageScore Average Credit Card Balance
1     Alabama                  654                      $5,961
2      Alaska                  668                      $8,516
3     Arizona                  669                      $6,389
4    Arkansas                  657                      $5,660
5  California                  680                      $6,481

In [38]:
state_finance_df = state_demo_df.merge(state_credit_df, left_on='State', right_on='State')

In [39]:
state_finance_df.head()

,State,Abr.,Municipal Population,2018,2017,2016,Average VantageScore,Average Credit Card Balance
0,Alabama,AL,198218,"$49,861","$48,123","$46,257",654,"$5,961"
1,Alaska,AK,31275,"$74,346","$73,181","$76,440",668,"$8,516"
2,Arizona,AZ,1660272,"$59,246","$56,581","$53,558",669,"$6,389"
3,Arkansas,AR,193524,"$47,062","$45,869","$44,334",657,"$5,660"
4,California,CA,508529,"$75,277","$71,805","$67,739",680,"$6,481"

In [40]:
state_finance_df = state_finance_df.set_index('State')

In [41]:
state_finance_df.head()

,Abr.,Municipal Population,2018,2017,2016,Average VantageScore,Average Credit Card Balance
State,,,,,,,
Alabama,AL,198218,"$49,861","$48,123","$46,257",654,"$5,961"
Alaska,AK,31275,"$74,346","$73,181","$76,440",668,"$8,516"
Arizona,AZ,1660272,"$59,246","$56,581","$53,558",669,"$6,389"
Arkansas,AR,193524,"$47,062","$45,869","$44,334",657,"$5,660"
California,CA,508529,"$75,277","$71,805","$67,739",680,"$6,481"

In [42]:
state_finance_df.to_csv("../DataFiles/combined_state_finance_data.csv", index=True)